Repository: 84000/data-translation-memory
Catalog: toh557-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Lord King of Sūtras, The Sublime Golden Light

source: འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། རང་སངས་རྒྱས་དང་། འཕགས་པ་ཉན་ཐོས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: I pay homage to all the buddhas, bodhisattvas, pratyekabuddhas, and noble śrāvakas in the past, future, and present.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བྱ་རྒོད་ཕུང་པོ་ཆོས་ཀྱི་དབྱིངས། །ཟབ་མོ་སངས་རྒྱས་སྤྱོད་ཡུལ་ན། །དེ་བཞིན་གཤེགས་པ་བཞུགས་ནས་ནི། །
en: The Tathāgata was dwelling On Vulture Peak, in the Dharma realm, The profound buddha field of activity.

source: དག་ཅིང་རྡུལ་རྣམས་མེད་པ་ཡི། །བྱང་ཆུབ་སེམས་དཔའ་མཆོག་རྣམས་ལ། །མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་སྟེ། །
en: He taught this Sublime Golden Light— Which is the lord king of sūtras— To the supreme bodhisattvas, Who are pure and immaculate.

source: མཉན་ན་ཤིན་ཏུ་ཟབ་པ་དང་། །ཡོངས་སུ་བརྟགས་ན་ཟབ་པ་ཉིད། །གསེར་འོད་དམ་པ་འདི་འཆད་དོ། །
en: It is profound to listen to And profound to analyze.

source: ཕྱོགས་བཞིར་སངས་རྒྱས་རྣམས་ཀྱིས་ནི། །བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་བརླབས་པ། །མི་འཁྲུགས་པས་ནི་ཤར་ཕྱོགས་སུ། །རིན་ཆེན་ཏོག་གིས་ལྷོ་ཕྱོགས་སུ། །འོད་དཔག་མེད་ཀྱིས་ནུབ་ཕྱོགས་སུ། །
en: It has received the blessings Of the buddhas in the four directions: The Buddha Akṣobhya in the east, The Buddha Ratnaketu in the south, The Buddha Amitābha in the west, And the Buddha Dundubhisvara in the north.

source: རྔ་སྒྲ་ཡིས་ནི་བྱང་ཕྱོགས་སུ། །སྡིག་པ་ཐམས་ཅད་གཞིག་པའི་ཕྱིར། །བཤད་པ་དམ་པ་བཀྲ་ཤིས་པ། །སྡིག་པའི་ལས་རྣམས་ཟད་བྱེད་པ། །
en: “I will teach that which is blessed, Which is a teaching of supreme auspiciousness, In order to eliminate all bad actions.

source: བདེ་བ་ཐམས་ཅད་སྦྱིན་བྱེད་པ། །སྡུག་བསྔལ་ཐམས་ཅད་འཇིག་བྱེད་པ། །
en: “It will bestow every happiness; It will eliminate all suffering.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གཞི། །དཔལ་ཀུན་གྱིས་ནི་ལེགས་བརྒྱན་པ། །བྱིན་གྱིས་བརླབས་ཏེ་བརྗོད་པར་བྱ། །སེམས་ཅན་གང་དག་དབང་པོ་ཉམས། །ཚེ་ཟད་པ་དང་ཚེ་ཉམས་དང་། །ཕུན་སུམ་ཚོགས་མིན་གང་ཆགས་དང་། །ལྷ་རྣམས་རྒྱབ་ཀྱིས་ཕྱོགས་པ་དང་། །མཛའ་སྡུག་སྐྱེ་བོ་སྡང་བ་དང་། །བྲན་བཟའ་ལ་སོགས་གཙེས་པ་དང་། །ཕན་ཚུན་མཐུན་པ་མ་ཡིན་དང་། །ནོར་འགྲིབས་པས་ནི་གནོད་པ་དང་། །
en: It is the basis of omniscience, And it is adorned by every splendor.

source: མྱ་ངན་ངལ་དང་གནོད་པ་དང་། །འཇིགས་པ་དང་ནི་ཕོངས་པ་དང་། །གཟའ་དང་རྒྱུ་སྐར་བྱད་སྟེམས་དང་། །མི་བཟད་གདོན་གྱིས་ཉེན་པ་དང་། །མྱ་ངན་ངལ་ལས་བྱུང་བ་ཡི། །རྨི་ལམ་སྡིག་པ་མཐོང་ན་ཡང་། །དེས་ནི་རབ་བཀྲུས་གཙང་མ་ཡིན། །མདོ་སྡེ་དམ་པ་མཉན་པར་བྱ། །གང་དག་ཡིད་དགེ་སེམས་དང་ཞིང་། །
en: “Beings with impaired faculties, Whose lives are in decline and ending; Those who are beset by misfortune, Who have been forsaken by the devas, “Who are hated by their spouses and other people, Who are tormented by family and servants, Who are in conflict with others, And who are oppressed by loss of wealth; “Those who are miserable, tired, and ruined, Who are frightened and in distress, Who are oppressed by planets and lunar asterisms, And who are afflicted by dreadful demons; “And those who see evil in their dreams Arising from misery and fatigue Should wash themselves clean And listen to this supreme sūtra.

source: གོས་གཙང་རྣམས་ཀྱིས་རབ་བརྒྱན་ཏེ། །ཟབ་མོ་སངས་རྒྱས་སྤྱོད་ཡུལ་བ། །མདོ་སྡེ་མཉན་པར་བྱེད་ན་ནི། །མདོ་སྡེ་འདི་ཡི་གཟི་བརྗིད་ཀྱིས། །སྲོག་ཆགས་ཀུན་གྱི་གནོད་པ་དག །ཤིན་ཏུ་མི་བཟད་འདི་འདྲ་བ། །དེ་དག་རྟག་ཏུ་ཞི་བར་འགྱུར། །
en: “For those who listen to this sūtra, This profound field of the buddhas, With a lucid mind and good motivation, And dressed in clean clothes— “For all those beings All those dreadful misfortunes Will always come to an end Through the brilliance of this sūtra.

source: འཇིག་རྟེན་སྐྱོང་བ་བདག་ཉིད་དང་། །བློན་པོ་ཚོགས་ཀྱི་དབང་ཕྱུག་བཅས། །གནོད་སྦྱིན་བྱེ་བ་དུ་མ་ཡིས། །དེ་དག་ལ་ནི་སྲུང་བར་བྱེད། །ལྷ་མོ་ཆེན་མོ་དབྱངས་ཅན་དང་། །ནཻ་རཉྫ་ནར་གནས་པ་དང་། །འབྱུང་པོའི་མ་མོ་འཕྲོག་མ་དང་། །
en: “The guardians of the world themselves And their ministers and army generals, As well as a multitude of millions of yakṣas, Will be their protectors.

source: ས་ཡི་ལྷ་མོ་བརྟན་མ་དང་། །ཚངས་པའི་དབང་དང་ལྷ་དབང་དང་། །ཀླུ་དབང་མཐུ་ཆེན་རྣམས་དང་ནི། །མི་འམ་ཅི་དབང་ལྷ་མིན་དབང་། །དེ་བཞིན་ནམ་མཁའ་ལྡིང་དབང་རྣམས། །སྡེ་དང་སྟོབས་དང་བཞོན་པ་དང་། །བཅས་ཏེ་དེ་དག་དེར་ལྷགས་ནས། །ཉིན་དང་མཚན་མོ་མི་གཡེལ་བར། །
en: “The great goddess Sarasvatī And Nairañjana­vasinī, Hārītī, the mother of spirits, And Dṛḍhā, the goddess of the earth; “The lords of Brahmā devas, lords of the devas; The greatly powerful lords of the nāgas; And the lords of the kinnaras, the lords of the asuras, And similarly the lords of the garuḍas “Will come to the place where those people are, Accompanied by troops and steeds, And will be their protectors, Attentive day and night.

source: དེ་དག་ལ་ནི་སྲུང་བར་བྱེད། །ཟབ་མོ་སངས་རྒྱས་སྤྱོད་ཡུལ་བ། །སངས་རྒྱས་ཀུན་གྱི་གསང་བ་སྟེ། །བསྐལ་པ་བྱེ་བར་རྙེད་དཀའ་བ། །མདོ་འདི་རབ་ཏུ་བཤད་པར་བྱ། །
en: “I will elucidate this sūtra, Which is the profound field of the buddhas, Which is the secret of all buddhas, And which is difficult to obtain in a million eons.

source: གང་དག་མདོ་འདི་ཉན་པ་དང་། །གང་དག་གཞན་ལ་ཐོས་བྱེད་དང་། །གང་སུ་རྗེས་སུ་ཡི་རང་དང་། །གང་དག་མཆོད་པ་བྱེད་པ་རྣམས། །དེ་དག་ལྷ་དང་ཀླུ་དག་དང་། །མི་དང་མི་འམ་ཅི་དག་དང་། །ལྷ་མིན་གནོད་སྦྱིན་དུ་མ་ཡིས། །
en: “Those who hear this sūtra And cause others to hear it, And those who rejoice in this sūtra, And those who make offerings to it, “Throughout millions of eons Will themselves receive offerings From devas, nāgas, and humans, And from kinnaras, asuras, and yakṣas.

source: བསྐལ་པ་བྱེ་བར་མཆོད་པར་འགྱུར། །སྲོག་ཆགས་བསོད་ནམས་མེད་པ་རྣམས། །དེ་དག་བསོད་ནམས་ཕུང་པོ་ནི། །མཐའ་ཡས་གྲངས་ཀྱང་མེད་པ་དང་། །བསམ་གྱིས་མི་ཁྱབ་སྐྱེ་བར་འགྱུར། །
en: “For beings who create this merit, There will arise for them An infinite, incalculable, Inconceivable mass of merit.

source: ཕྱོགས་བཅུའི་རྫོགས་པའི་སངས་རྒྱས་དང་། །དེ་བཞིན་ཟབ་མོར་སྤྱོད་པ་ཡིས། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཀྱང་། །རབ་ཏུ་གཟུང་བར་འགྱུར་བ་ཡིན། །
en: “They will be taken into the care Of the perfect buddhas in the ten directions, And similarly by the bodhisattvas Who have profound activity.

source: གཙང་མའི་གོས་རྣམས་རབ་བགོས་ལ། །དྲི་ཞིམ་པ་ཡི་གོས་འཆང་ཞིང་། །བྱམས་པའི་སེམས་ནི་ཉེར་བཞག་ནས། །གཡེལ་བ་མེད་པར་མཆོད་པར་བྱ། །
en: “Having put on clean clothes, Wearing perfumed clothing, And having a loving mind, They should offer without distraction.

source: རང་གི་སེམས་ནི་དྲི་མེད་ཅིང་། །རྒྱ་ཆེ་བར་ཡང་རབ་བྱེད་ལ། །སེམས་ཀྱང་ཤིན་ཏུ་དང་བྱེད་ཀྱིས། །མདོ་སྡེ་དམ་པ་མཉན་པར་གྱིས། །
en: “They should make their Own minds pure and vast, And with minds filled with faith, They should listen to this sublime sūtra.

source: གང་དག་མདོ་འདི་ཉན་པ་ནི། །དེ་དག་མི་ནང་ལེགས་པར་འོངས། །མི་ཡི་སྲིད་པ་ལེགས་པར་ཐོབ། །འཚོ་བ་བདེ་བས་འཚོ་བར་འགྱུར། །
en: “Those who listen to this sūtra Will be welcomed among humans, Will attain an excellent human existence, And will live happy lives.

source: གང་གི་རྣ་བའི་བུ་གར་ཡང་། །བཤད་པ་འདི་ནི་གྲག་འགྱུར་བ། །དེ་དག་དགེ་རྩ་སྦྱངས་པ་སྟེ། །སངས་རྒྱས་མང་པོས་རབ་ཏུ་བསྔགས། །
en: “Those in whose ears This teaching sounds Will plant good roots And be praised by many buddhas.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་དང་པོའོ།། །།
en: This concludes “The Introduction,” the first chapter of “The Lord King of Sūtras, The Sublime Golden Light.”

source: ཡང་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཛེས་པའི་ཏོག་ཅེས་བྱ་བ།
en: Chapter 2: The Teaching on the Lifespan of the Tathāgata Also, at that time, there dwelled in the great city of Rājagṛha a bodhisattva mahāsattva by the name of Ruciraketu.

source: སྔོན་གྱི་རྒྱལ་བ་ལ་བསྙེན་བཀུར་བྱས་པ། དགེ་བའི་རྩ་བ་བསྐྱེད་པ། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་ལ་རིམ་གྲོ་བྱས་པ་ཞིག་གནས་པ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: He had served past jinas, had developed roots of merit, and had attended upon many hundreds of thousands of quintillions of buddhas.

source: རྒྱུ་གང་དང་རྐྱེན་གང་གིས། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་འདི་ལྟ་སྟེ། ལོ་བརྒྱད་ཅུ་ཞིག་ཐུབ་སྟེ། འདི་ལྟར་སྐུ་ཚེ་ཐུང་སྙམ་ནས།
en: He thought, “Through what causes and what conditions does the Bhagavat Śākyamuni have such a short lifespan of eighty years?”

source: དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་འདི་སྐད་དུ། རྒྱུ་གཉིས་དང་རྐྱེན་གཉིས་ཀྱིས་ཚེ་རིང་བར་འགྱུར་ཏེ།
en: Then he thought, “The Bhagavat has said, ‘There are two causes and two conditions for a long life.

source: གཉིས་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: What are those two?

source: སྲོག་གཅོད་པ་སྤངས་པ་དང་། ཁ་ཟས་རབ་ཏུ་སྦྱིན་པའོ་ཞེས་གསུངས་ཏེ།
en: Forsaking killing and giving food.’

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་ནི། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་པ་མང་པོ་ནས། སྲོག་གཅོད་པ་སྤངས་པར་གྱུར་པ་ནས། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱི་བར་དུ་ཡང་དག་པར་བླངས་པར་གྱུར།
en: The Bhagavat Śākyamuni has forsaken killing and has correctly adopted the path of the ten good actions for countless hundreds of thousands of quintillions of eons.

source: ཟས་དང་ཕྱི་ནང་གི་དངོས་པོ་རྣམས་སེམས་ཅན་དག་ལ་ཡོངས་སུ་བཏང་སྟེ། ཐ་ན་རང་གི་ལུས་ཀྱི་ཤ་དང་ཁྲག་དང་རུས་པ་དང་རྐང་གིས་ཀྱང་སེམས་ཅན་ལྟོགས་པ་རྣམས་ཚིམ་པར་མཛད་ན། ཟས་གཞན་གྱིས་ལྟ་ཅི་སྨོས་སྙམ་མོ། །
en: He has given external and internal substances as food to beings, even to the extent of satisfying hungry beings with his own body, blood, bones, and limbs, to say nothing of every other kind of food.”

source: དེ་ནས་སྐྱེས་བུ་དམ་པ་དེ་སངས་རྒྱས་ལ་སོང་བའི་ཡིད་ལ་བྱེད་པ་དག་ལས། འདི་ལྟ་བུའི་ཚུལ་གྱིས་བསམ་པ་འདི་དག་སེམས་པ་ན། དེའི་ཁྱིམ་ཡངས་ཤིང་རྒྱ་ཆེ་ལ་བཻཌཱུརྱ་སྔོན་པོ་ལས་གྲུབ་པ།
en: When that sublime being’s mind had thought this, with his attention focused upon the Buddha, his house became immense, vast, and made of blue beryl.

source: ལྷའི་རིན་པོ་ཆེ་དུ་མས་སྤྲས་པ། དེ་བཞིན་གཤེགས་པས་ཁ་དོག་བསྒྱུར་བ། ལྷའི་ལས་འདས་པའི་སྤོས་ཀྱིས་ཁྱབ་པར་གྱུར་ཏོ། །
en: It was adorned by many divine jewels, its color transformed by the Tathāgata, and it was pervaded by a perfume that transcended the divine.

source: ཁྱིམ་དེའི་ཕྱོགས་བཞི་ནས་ལྷའི་རིན་པོ་ཆེའི་ཁྲི་བཞི་བྱུང་བར་གྱུར་ཏེ།
en: In the four directions of that house there appeared four thrones made of divine jewels.

source: ཁྲི་དེ་དག་ལས་ཀྱང་ལྷའི་རས་བཅོས་བུའི་རིན་པོ་ཆེའི་ཕྲུགས་རྣམས་བཏིང་བ་དག་བྱུང་བར་གྱུར་ཏོ། །
en: The thrones were overspread with layers of precious, divine cloth decorated with divine jewels.

source: ཁྲི་དེ་དག་ལས་ཀྱང་ལྷའི་མེ་ཏོག་པདྨ་རིན་པོ་ཆེ་དུ་མས་སྤྲས་པ། དེ་བཞིན་གཤེགས་པས་ཁ་དོག་བསྒྱུར་བ་དག་བྱུང་ངོ་། །
en: Upon those thrones appeared divine lotus flowers, their colors transformed by the Tathāgata, and adorned by many jewels.

source: པདྨ་དེ་དག་ལས་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞི་བྱུང་བར་གྱུར་ཏེ།
en: Upon those lotuses there appeared the four buddha bhagavats.

source: ཤར་ཕྱོགས་ནས་ནི་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་བྱུང་།
en: To the east appeared the Tathāgata Akṣobhya.

source: ལྷོ་ཕྱོགས་ནས་ནི་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཏོག་བྱུང་།
en: To the south appeared the Tathāgata Ratnaketu.

source: ནུབ་ཕྱོགས་ནས་ནི་དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་བྱུང་།
en: To the west appeared the Tathāgata Amitāyus.

source: བྱང་ཕྱོགས་ནས་ནི་དེ་བཞིན་གཤེགས་པ་རྔ་སྒྲ་བྱུང་སྟེ།
en: To the north appeared the Tathāgata Dundubhisvara.

source: སེང་གེའི་ཁྲི་དེ་དག་ལས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བྱུང་མ་ཐག་ཏུ། དེ་ནས་དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བར་དང་། ཕྱོགས་བཅུ་ཀུན་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བར་དང་། ཕྱོགས་བཅུ་ཀུན་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བར་དག་སྣང་བས་ཁྱབ་པར་གྱུར།
en: At the moment when those buddha bhagavats appeared upon those lion thrones, the great city of Rājagṛha was filled by a great illuminating light that spread throughout the trichiliocosm world realm, throughout as many world realms in the ten directions as there are grains of sand in the Ganges River.

source: ལྷའི་མེ་ཏོག་དག་གི་ཆར་ཡང་བབ།
en: A rain of flowers fell.

source: ལྷའི་སིལ་སྙན་གྱི་སྒྲ་ཡང་བྱུང་ངོ་། །
en: There came the sound of divine music.

source: སངས་རྒྱས་ཀྱི་མཐུས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་སེམས་ཅན་ཐམས་ཅད་ཀྱང་ལྷའི་བདེ་བ་དང་ལྡན་པར་གྱུར་ཏེ། སེམས་ཅན་དབང་པོ་མ་ཚང་བ་རྣམས་ནི་དབང་པོ་ཐམས་ཅད་དང་ལྡན་པར་གྱུར།
en: Through the power of the Buddha, all beings in this trichiliocosm world realm gained divine happiness.

source: སེམས་ཅན་དམུས་ལོང་ད་ག་ནི་མིག་གིས་གཟུགས་རྣམས་མཐོང་། སེམས་ཅན་འོན་པ་དག་ནི་རྣ་བས་སྒྲ་རྣམས་ཐོས། སེམས་ཅན་སྨྱོས་པ་དག་ནི་དྲན་པ་སོ་སོར་རྙེད། སེམས་ཅན་སེམས་གཡེང་བ་དག་ནི་སེམས་མི་གཡེང་བར་གྱུར། སེམས་ཅན་སྒྲེན་མོ་དག་ནི་གོས་བགོས་པར་གྱུར། སེམས་ཅན་བཀྲེས་པ་དག་ནི་ལྟོ་འགྲངས་པར་གྱུར། སེམས་ཅན་སྐོམ་པ་དག་ནི་སྐོམ་ངོམས་པར་གྱུར། སེམས་ཅན་ནད་ཀྱིས་བཏབ་པ་དག་ནི་ནད་དང་བྲལ་བར་གྱུར།
en: The blind saw forms with their eyes; the deaf heard sounds with their ears; the insane gained their sanity; those with distracted minds became undistracted; the naked became clothed; the hungry had their stomachs filled; the thirsty had their thirst quenched; beings afflicted by illness were healed; and those with impaired physical faculties became possessed of complete faculties.

source: ལུས་ཀྱི་དབང་པོ་ཉམས་པ་དག་ནི་དབང་པོ་རྣམས་ཚང་བར་གྱུར་ཏེ། འཇིག་རྟེན་དུ་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་རྣམས་རྒྱ་ཆེར་བྱུང་བར་གྱུར་ཏོ། །
en: In those worlds there appeared vast, astonishing, wonderful qualities.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་མཐོང་ནས་ངོ་མཚར་རྨད་དུ་གྱུར་ཏེ། དེ་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ། དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: The bodhisattva Ruciraketu was amazed to see those buddha bhagavats, and, filled with joy, delighted, elated, pleased, and happy, with his palms together in homage, he bowed toward those buddha bhagavats.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་རྣམས་རྗེས་སུ་དྲན་ལ། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་ཡོན་ཏན་རྗེས་སུ་དྲན་ཞིང་། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད་ལ་ཐེ་ཚོམ་ཟ་བར་གྱུར་ཏེ།
en: Mindful of those buddha bhagavats and mindful of the qualities of the Buddha Bhagavat Śākyamuni, he had doubts concerning the lifespan of the Bhagavat Śākyamuni.

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་འདི་ལྟར་ལོ་བརྒྱད་ཅུ་ཞིག་ཐུབ་སྟེ་སྐུ་ཚེ་ཐུང་བ་འདི་ཇི་ལྟ་བུ། འདི་ཅི་ཞིག་སྙམ་དུ་བསམ་པ་དེ་སེམས་ཤིང་འདུག་པར་གྱུར་ཏོ། །
en: In his mind was the thought, “Why is it that the Bhagavat Śākyamuni has this short lifespan of eighty years?”

source: དེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་དགོངས་ཤིང་མཁྱེན་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་ཁྱོད་འདི་སྙམ་དུ། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་འདི་ལྟར་སྐུ་ཚེ་ཐུང་ངོ་སྙམ་དུ་མ་སེམས་ཤིག །
en: Those buddha bhagavats were aware of and understood these thoughts and said to the bodhisattva Ruciraketu, “Noble son, do not think, ‘The Bhagavat Śākyamuni has such a short lifespan.’

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་མ་གཏོགས་པར། ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་དང་། བདུད་དང་བཅས་པ་དང་། ཚངས་པ་དང་བཅས་པ་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་དང་། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་ནང་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད་ཀྱི་མཐའ། ཕྱི་མའི་མཐའི་མུའི་བར་དུ་ཡང་རྟོགས་པར་ནུས་པ་ངེད་ཀྱིས་སུ་ཡང་མ་མཐོང་ངོ་། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་བཤད་པ་བརྗོད་མ་ཐག་ཏུ། དེ་ནས་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་མཐུས་ལྷའི་བུ་འདོད་པ་ན་སྤྱོད་པ་རྣམས་དང་། གཟུགས་ན་སྤྱོད་པ་རྣམས་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་།
en: Noble son, except for the tathāgata arhat samyak­saṃbuddhas, we do not see anyone in the world with its devas, with its Māra, with its Brahmā, with its many beings who are mendicants and brahmins, and with its devas, humans, and asuras who has the ability to know the length of the Bhagavat Tathāgata Śākyamuni’s lifespan to its future limit.”

source: ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་བར་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་འདུས་ནས།
en: As soon as those buddha bhagavats described the Tathāgata’s lifespan, at that moment, through the power of the buddhas, the devas in the desire realm, the devas in the form realm, the nāgas, the yakṣas, the gandharvas, the asuras, the garuḍas, the kinnaras, the mahoragas, and the many hundreds of thousands of quintillions of assembled bodhisattvas arrived in the house of the bodhisattva Ruciraketu.

source: བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གི་ཁྱིམ་དེར་ལྷགས་སོ། །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ལ། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད་བཤད་པ་ཚིགས་སུ་བཅད་དེ་མདོར་བཀའ་སྩལ་པ། རྒྱ་མཚོའི་ཆུ་རྣམས་ཐམས་ཅད་ཀྱི། །ཐིགས་པ་དག་ནི་བགྲང་བར་ནུས། །
en: Those tathāgatas then recited verses that taught in brief the lifespan of the Bhagavat Śākyamuni to that complete assembly: “The drops of water in all The oceans can be calculated, But no one can calculate The lifespan of Śākyamuni.

source: ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད། །སུས་ཀྱང་བགྲང་བར་མི་ནུས་སོ། །རི་རབ་རྣམས་ནི་ཐམས་ཅད་ཀྱང་། །ཕྲ་རབ་རྡུལ་དུ་བགྲང་བར་ནུས། །ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད། །
en: “The number of atoms in all Sumerus can be calculated, But no one can calculate The lifespan of Śākyamuni.

source: སུས་ཀྱང་བགྲང་བར་མི་ནུས་སོ། །ས་ལ་གང་དག་ཡོད་པ་ཡི། །རབ་ཏུ་ཕྲ་རྡུལ་ཇི་སྙེད་པ། །ཐམས་ཅད་བགྲང་བར་ནུས་སྲིད་ཀྱི། །རྒྱལ་བའི་སྐུ་ཚེའི་ཚད་མི་ནུས། །
en: “Someone might calculate The number of atoms in the earth, But no one can calculate The entire lifespan of the Jina.

source: གལ་ཏེ་ལ་ལས་ནམ་མཁའ་ལ། །སྣ་འགའ་ཞིག་གིས་དཔག་འདོད་ཀྱང་། །ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད། །སུས་ཀྱང་བགྲང་བར་མི་ནུས་སོ། །
en: “Someone might calculate The extent of space, But no one can calculate The lifespan of Śākyamuni.

source: རྫོགས་པའི་སངས་རྒྱས་འདི་སྲིད་བཞུགས། །བསྐལ་པ་དག་ནི་འདི་སྙེད་ཅིག །བསྐལ་པ་བྱེ་བ་བརྒྱ་དག་ཅེས། །གྲངས་ནི་རྙེད་པར་མི་རུང་ངོ་། །
en: “One cannot reach a number By saying that the perfect Buddha Will remain for this number of eons Or for a hundred million eons.

source: གང་ཕྱིར་དེ་ཡི་རྒྱུ་དང་ནི། །རྐྱེན་ཡང་རྣམ་པ་གཉིས་ཡིན་ཏེ། །སྡིག་པའི་འཚེ་བ་སྤངས་པ་དང་། །ཁ་ཟས་མང་པོ་བྱིན་པ་སྟེ། །
en: “This is because of two causes And because of two conditions: He has forsaken violence toward others, And he has given food numerous times.

source: དེ་ཕྱིར་བདག་ཉིད་ཆེན་པོ་དེའི། །སྐུ་ཚེའི་ཚད་གྲངས་མི་རྙེད་དོ། །བསྐལ་པ་འདི་སྙེད་ཅིག་ཅེ་འམ། །གྲངས་མེད་པ་ཡང་དེ་བཞིན་ཏེ། །
en: “Therefore, the length of the great being’s Lifespan cannot be calculated By saying it is a certain number of eons, Or likewise by saying it is countless eons.

source: དེ་བས་ཐེ་ཚོམ་མེད་པར་འགྱུར། །ཐེ་ཚོམ་ཅུང་ཟད་མ་ཟ་ཤིག །
en: “Therefore, do not doubt, do not have any doubt whatsoever.

source: རྒྱལ་བའི་སྐུ་ཚེ་ཐ་མ་ཡི། །གྲངས་ནི་གང་དུ་མི་དམིགས་སོ། །
en: No one can conceive of the final extent of a jina’s lifespan.”

source: དེ་ནས་དེའི་ཚེ་འཁོར་དེར་སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱ་ཞེས་བྱ་བ་དང་། བྲམ་ཟེ་སྟོང་ཕྲག་དུ་མས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོའི་སྒྲ་ཐོས་ནས་འཕྲལ་ལ་འདུས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་ནས།
en: At that time, in that assembly, there was the Kauṇḍinya brahmin, the Dharma master Vyākaraṇa, who, together with countless thousands of brahmins, had made offerings to the Bhagavat.

source: བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། གལ་ཏེ་བཅོམ་ལྡན་འདས་སེམས་ཅན་ཐམས་ཅད་ལ་ཐུགས་བརྩེ་བ། ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ། ཕན་པར་བཞེད་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕ་མ་ལྟ་བུ། མི་མཉམ་པ་དང་མཉམ་པར་གྱུར་པ། ཟླ་བ་ལྟ་བུར་སྣང་བར་མཛད་པ། ཤེས་རབ་དང་ཡེ་ཤེས་ཆེན་པོའི་ཉི་མ་ཤར་བ་ལྟ་བུ་ལགས་ཤིང་། གལ་ཏེ་ཁྱོད་སེམས་ཅན་ཐམས་ཅད་ལ་སྒྲ་གཅན་ཟིན་བཞིན་དུ་གཟིགས་ན། བདག་ལ་དམ་པ་ཞིག་སྩལ་དུ་གསོལ།
en: On hearing these words concerning the great nirvāṇa of the Tathāgata, he immediately wept, bowed down to the feet of the Bhagavat, and said to the Bhagavat, “If you have love for all beings, if you have great compassion, if you wish to benefit all beings, if you are a mother and father for all beings, if you are unequaled, if you are like the moon radiating light, if you are like a risen sun of great wisdom and knowledge, and if you look upon all beings as you do upon Rāhula, then I pray that you grant me something sacred.”

source: བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བར་གྱུར་ཏོ། །
en: The Bhagavat remained silent.

source: དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་འཁོར་དེར་ལིཙྪ་བཱི་གཞོན་ནུ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མཐོང་ན་དགའ་བ་ཞེས་བྱ་བ་དེ་སྤོབས་པ་སྐྱེས་ནས།
en: Then, through the power of the Buddha, there arose confident eloquence in a Licchavī youth in that assembly, whose name was Sarva­sattva­priyadarśana.

source: སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཅི་བྲམ་ཟེ་ཆེན་པོ་ཁྱོད། བཅོམ་ལྡན་འདས་ལ་དམ་པ་ཅིག་གསོལ་ལམ།
en: He asked the Kauṇḍinya brahmin, the Dharma master Vyākaraṇa, “Great brahmin, why do you ask the Bhagavat for something sacred?

source: བདག་གིས་ཁྱོད་ལ་དམ་པ་ཞིག་སྦྱིན་ནོ། །
en: I will give you something sacred.”

source: བྲམ་ཟེས་སྨྲས་པ། ལིཙྪ་བཱི་གཞོན་ནུ་བདག་ནི་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་དང་རིང་བསྲེལ་གྱི་ཕྱེ་མ་བགོས་པའི་ཕྱིར། བཅོམ་ལྡན་འདས་ཀྱི་རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་ལ་བསྟེན་པར་འདོད་དོ། །
en: “Licchavī youth,” said the brahmin, “I wish for a relic of the Bhagavat the size of a mustard seed in order to make offerings to the Bhagavat.

source: རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་དེ་མངོན་པར་མཆོད་ན། སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་བདག་པོ་འབའ་ཞིག་ཐོབ་ཅེས་གྲགས་སོ། །
en: It is known that if one makes offerings to a relic the size of a mustard seed that one has received as a share of the ashes that are the relics of the Bhagavat, one will become the sole lord of the devas of Trāyastriṃśa.

source: ཀྱེ་ལིཙྪ་བཱི་གཞོན་ནུ་གསེར་འོད་དམ་པའི་མདོ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཤེས་པར་དཀའ་བ།
en: “O Licchavī youth, it is difficult for śrāvakas and pratyekabuddhas to know The Sūtra of the Sublime Golden Light.

source: ཁོང་དུ་ཆུད་པར་དཀའ་བ་དེ་ལྟ་བུའི་མཚན་ཉིད་དང་ཡོན་ཏན་དང་ལྡན་པ་གསེར་འོད་དམ་པའི་མདོ་འཆད་ཅེས་གྲག་གིས་ཉོན་ཅིག །
en: It is difficult for them to comprehend it. The Sūtra of the Sublime Golden Light, which has those characteristics and qualities, is going to be spoken, so listen!

source: ཀྱེ་ལིཙྪ་བཱི་གཞོན་ནུ་གསེར་འོད་དམ་པའི་མདོ་ནི། དེ་ལྟར་ཤེས་པར་དཀའ་ཞིང་རྟོགས་པར་དཀའ་བས་ན།
en: “O Licchavī youth, The Sūtra of the Sublime Golden Light is thus difficult to know and difficult to understand.

source: ཁོ་བོ་ཅག་མཐའ་འཁོབ་ཀྱི་གླིང་གི་བྲམ་ཟེ་རྣམས་ནི། གང་བཅངས་པ་ན་སེམས་ཅན་རྣམས་མྱུར་དུ་སུམ་ཅུ་རྩ་གསུམ་པའི་བདག་པོ་འཐོབ་པར་འགྱུར་བའི་རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་ཟ་མ་ཏོག་གི་ནང་དུ་བཅུག་ལ་བཅངས་ཀྱང་རུང་ངོ་། །
en: Therefore, it is appropriate that we brahmins from an outlying island should keep a relic the size of a mustard seed in a casket, for by possessing it, beings will soon become lords of Trāyastriṃśa.

source: ཀྱེ་ལིཙྪ་བཱི་གཞོན་ནུ་ཁྱོད་ཅི་དེ་བཞིན་གཤེགས་པ་ལས་རིང་བསྲེལ་ཡུངས་འབྲུ་ཙམ་གསོལ་ནས། རིང་བསྲེལ་ཟ་མ་ཏོག་ཏུ་བཅུག་སྟེ་བཅངས་པས་སེམས་ཅན་རྣམས་སུམ་ཅུ་རྩ་གསུམ་པའི་བདག་པོ་ཐོབ་པར་མི་འདོད་དམ།
en: “O Licchavī youth, don’t you want to request a relic the size of a mustard seed from the Tathāgata, place the relic in a casket, and possess it so that beings will become lords of Trāyastriṃśa?

source: ཀྱེ་ལིཙྪ་བཱི་གཞོན་ནུ་ཁོ་བོས་ནི་དམ་པ་དེ་ལྟ་བུ་གསོལ་ཏོ། །དེ་ནས་ལིཙྪ་བཱི་གཞོན་ནུ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མཐོང་ན་དགའ་བས།
en: “O Licchavī youth, that is the sublime thing that I have requested.”

source: སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱ་ལ་ཚིགས་སུ་བཅད་པ་དག་གིས་སླར་སྨྲས་པ། ནམ་ཞིག་གང་གཱའི་ཆུ་རྒྱུན་ལ། །མེ་ཏོག་རྣམས་ནི་སྐྱེ་བ་དང་། །བྱ་རོག་དམར་པོར་འགྱུར་བ་དང་། །ཁུ་བྱུག་དུང་མདོག་འདྲར་འགྱུར་དང་། །འཛམ་བུར་ཏ་ལའི་འབྲུ་ཆགས་དང་། །འབྲ་གོར་ཨ་མྲའི་དོགས་པ་ཆགས། །
en: Then Sarva­sattva­priyadarśana, the Licchavī youth, recited these verses to the Kauṇḍinya brahmin, the Dharma master Vyākaraṇa: “When flowers grow On the Ganges River, Crows become red, And cuckoos become conch-colored; “When palm-tree fruit grow on rose-apple trees; And when bunches of mangoes grow on date trees, That will be the time when a relic The size of a mustard seed will appear.

source: དེ་ཡི་ཚེ་ན་ཡུངས་འབྲུ་ཙམ། །རིང་བསྲེལ་དུ་ནི་གསལ་བར་འགྱུར། །ནམ་ཞིག་རུས་སྦལ་སྤུ་རྣམས་ལས། །གོས་སུ་ལེགས་པར་བཏགས་གྱུར་ཏེ། །དགུན་གྱི་གྲང་བ་སེལ་བྱེད་པ། །
en: “When clothes made from The hair of turtles are worn, And they dispel the cold of winter, Then there will be a relic.

source: དེ་ཚེ་རིང་བསྲེལ་ཡོད་པར་འགྱུར། །ནམ་ཞིག་སྦྲང་བུའི་རྐང་ལག་ལས། །ཡང་ཐོག་ལེགས་པར་བྱས་གྱུར་ཏེ། །བརྟན་ཞིང་རབ་ཏུ་མི་གཡོ་བ། །
en: “When roofs are made From the legs of flies And are solid and stable, Then there will be a relic.
